fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/CommonModules/ВКМ_ОбщиеПроцедурыИФункции/Module.bsl
#Область СлужебныеПроцедурыИФункции

//
//Параметр:
// СсылкаНаДоговор - СправочникСсылка.ДоговорыКонтрагентов
//Возвращаемое значение
// ВидДоговора - Перечисления.ВидыДоговоровКонтрагентов

Функция ВКМ_ОпределитьВидДоговора(СсылкаНаДоговор) Экспорт
// ++ БелГН ВКМ 20.10.2025
	
	ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДоговор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВидДоговора = Выборка.ВидДоговора;
	КонецЕсли;
	
	Возврат ВидДоговора;
	
// --
КонецФункции
	
//
//Параметр:
// СсылкаНаДоговор - СправочникСсылка.ДоговорыКонтрагентов
// СсылкаНаДокумент - ДокументСсылка.РеализацияТоваровУслуг
//Возвращаемое значение
// Булево

Функция ВКМ_ПроверкаСозданияДокументаСАбонОплатойВМесяце(СсылкаНаДоговор, СсылкаНаДокумент) Экспорт
// ++ БелГН ВКМ 20.10.2025

	ЕстьДокумент = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Договор = &Договор
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|	И РеализацияТоваровУслуг.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Договор", СсылкаНаДоговор);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЕстьДокумент = Истина;
	КонецЕсли;

	Возврат ЕстьДокумент;
	
// --
КонецФункции
	
//
//Параметр:
// Сотрудник - СправочникСсылка.ФизическиеЛица
// Дата - Дата
//Возвращаемое значение
// ПроцентОплаты

Функция ВКМ_ПолучитьПроцентОплатыСотрудника(Сотрудник, Дата) Экспорт
// ++ БелГН ВКМ 25.10.2025

	ПроцентОплаты = Неопределено;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
		
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПроцентОплаты = Выборка.ПроцентОтРабот;
	КонецЕсли;

	Возврат ПроцентОплаты;
	
// --
КонецФункции

#КонецОбласти
